import React from 'react'

const RulesPage = () => (
  <div className='container'>
    <div className='text-center'>
      <h3 className='section-title'><i className='fas fa-book-open mr-2' />Правила</h3>
      <div className='text-justify'>
        <p>
        Бикове и крави е логическа игра за отгатване на цифри. Играе се от двама противника, като всеки се стреми да отгатне тайното число, намислено от другия. След всеки ход, противникът дава броя на съвпаденията. Играта протича по следния начин. На лист хартия всеки участник написва своето тайно число. Тайните числа са четирицифрени, като цифрите не трябва да се повтарят. След това, последователно един след друг, играчите задават въпрос с предположение за числото на противника. Противникът отговаря, като посочва броя на съвпаденията – ако дадена цифра от предположението се съдържа в тайното число и се намира на точното място, тя е „бик“, ако пък е на различно място, е „крава“.
        </p>
        <p>Пример:
          <ul>
            <li>
        Тайно число: 4271
            </li>
            <li>
        Предположение: 1234
            </li>
            <li>
        Отговор: „1 бик и 2 крави“. (Бикът е „2“, а кравите са „4“ и „1“.)
            </li>
          </ul>
На всеки ход играчите записват предположените числа и отговорите, за да могат чрез дедукция да идентифицират цифрите в тайното число на противника.
        </p>
        <p>
Първият играч, който открие тайното число на противника, е победител. Тъй като участникът, който започва, има логическо предимство, победителят от предната игра ще играе втори на ход. В някои случаи всеки играч има равен брой ходове, така че, ако първият пръв открие числото на противника, вторият има право на още един ход и ако и той успее, играта завършва наравно.
        </p>
        <p>
Въпреки простите правила, играта е сравнително трудна и доста занимателна. Може да се играе и отборно, с екипи от по двама-трима играчи, които разсъждават заедно относно числата, които изиграват, подобно на отборния шахмат.
        </p>
        <p>
Играта съществува от много десетилетия. Първата компютърна версия на тази игра (moo, „муу“) е написана през 60-те години на PL/I, но играта се играе доста по-отдавна. Впоследствие се появяват множество варианти, като един от най-известните е „Мастермайнд“, която се играе не с цифри, а с пионки в различни цветове.
        </p>
        <p>
Поради лесните и прости правила и занимателната същност на „Бикове и крави“, съществуват множество варианти за електронни устройства – мобилни телефони и организатори, преносими компютри, лични цифрови помощници (PDA) и др.
        </p>
      </div>
    </div>
  </div>
)

export default RulesPage
